Revit 2024 API
FabricationVersionInfo Members
The FabricationVersionInfo type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the FabricationVersionInfo
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Reason
 The user-specified reason for the change.
Version
 The version number of the change.
See Also
FabricationVersionInfo Class
Autodesk.Revit.DB Namespace